app/controllers/news_controller.rb

    def index
        @news = News.all
---
SELECT "news".* FROM "news"