app/controllers/welcome_controller.rb

  def index
    @news = News.all
---
SELECT "news".* FROM "news"

    @posts.each do |post|
      if post[:title] != nil
        if @news.length == 0
          News.create({:title => post[:title],:description => post[:description],:image => post[:image], :url =>  post[:url]})
---
INSERT INTO "news" ("title", "description", "image", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)